{
  "genres": [
    {
      "id": 1,
      "name": "Action",
      "description": "Action movies. thrilling from start to end"
    },
    {
      "id": 2,
      "name": "Sci fi",
      "description": "Science fiction movies. No neccessarily realistic"
    },
    {
      "id": 3,
      "name": "Comedy",
      "description": "Funny movies. Laugh till you start to cry"
    },
    {
      "id": 4,
      "name": "Romance",
      "description": "Love movies"
    },
    {
      "id": 5,
      "name": "Adventure",
      "description": "Adventurous movies"
    },
    {
      "id": 6,
      "name": "Thriller",
      "description": "Thriller movies"
    }
  ],
  "movies": [
    {
      "id": 1,
      "title": "Angel has fallen",
      "genreId": 1,
      "releaseDate": "21-06-2019",
      "picture": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2019/08/23/Pictures/_7b9f7cdc-c58a-11e9-b964-dfb37bdfef35.jpg",
      "summary": "Secret Service agent Mike Banning (Gerard Butler) undergoes training at a private military facility owned by his friend Wade Jennings (Danny Huston), a former fellow Army Ranger who is currently the CEO of the private military company Salient Global, and is recommended for the position of Secret Service Director by the President of the United States, Allan Trumbull (Morgan Freeman), to replace retiring Director David Gentry (Lance Reddick). Banning hides the fact that he is suffering from migraines and insomnia with regular visits to several doctors, and begins taking medication to cope with recurring back pain.\n\nWhile the President is on a rural fishing trip, armed drones attack his protection detail, with only Banning surviving and saving the President; both are incapacitated, with Trumbull in a coma. FBI Agent Helen Thompson (Jada Pinkett Smith) finds substantial evidence that Banning may be responsible for the attack, with the van used to carry out the attack containing Banning's hair and DNA. Banning is subsequently arrested.\n\nEn route to a detention facility, Banning and his transport are ambushed. He escapes after killing the assailants, revealed to be agents who took part in his training exercise; Banning realizes that Jennings has betrayed and framed him. Banning calls his wife Leah (Piper Perabo), letting her know he is alive and that he wants to find out who is really behind this. The call alerts Thompson to Banning's location, leading to a car chase. However, Banning escapes again before heading to his father's home in the woods.\n\nWith Trumbull still comatose, Vice President Martin Kirby (Tim Blake Nelson) is sworn in as Acting President. Via surveillance cameras, Banning and his father Clay (Nick Nolte) observe Jennings' men approaching the house; Clay detonates explosives around the perimeter, killing the would-be attackers as he and Banning escape, and Banning reveals to his father that he has a wife and daughter. Leah and her daughter are on the verge of being kidnapped by Jennings' men when Clay saves them. Kirby reveals to the press that Banning is responsible for the assassination attempt with support from the Russian government.\n\nFinding the bodies around Clay's cabin, Thompson deduces that Banning was set up. Trumbull awakens from his coma, and Kirby is revealed to be involved with Jennings. Kirby plans to retaliate for the President's “attempted assassination” by attacking Russia. Thompson and another agent meet Jennings, who kills them both.\n\nBanning reaches Trumbull's hospital and is captured, but Trumbull orders his release. Banning leads Trumbull to safety with help from Gentry and other loyal agents, as Jennings destroys the hospital's Intensive Care Unit by increasing the oxygen and nitrogen supply to unstable levels, causing an explosion.\n\nBanning hides Trumbull and Gentry as Jennings' men pursue them. After a long gun battle, Jennings attempts to escape via helicopter, which Banning destroys. They face off hand-to-hand, and Banning mortally stabs Jennings. Banning is exonerated while Trumbull and Gentry arrest Kirby for treason due to the evidence kept by Jennings as an insurance policy and uncovered by Thompson before her death. Clay decides to live with Banning and his family. Feeling guilty over his failure to protect Trumbull, as well as his undisclosed ailments, Banning offers his resignation, but Trumbull forgives his mistakes and offers Banning the promotion to Director of the Secret Service, which he accepts.",
      "genre": {
        "id": 1,
        "name": "Action",
        "description": "Action movies. thrilling from start to end"
      }
    },
    {
      "id": 2,
      "title": "Parasite",
      "genreId": 6,
      "releaseDate": "15-03-2019",
      "picture": "https://i.ytimg.com/vi/isOGD_7hNIY/maxresdefault.jpg",
      "summary": "The Kims - mother and father Chung-sook and Ki-taek, and their young adult offspring, son Ki-woo and daughter Ki-jung - are a poor family living in a shabby and cramped half basement apartment in a busy lower working class commercial district of Seoul. Without even knowing it, they, especially Mr. and Mrs. Kim, literally smell of poverty. Often as a collective, they perpetrate minor scams to get by, and even when they have jobs, they do the minimum work required. Ki-woo is the one who has dreams of getting out of poverty by one day going to university. Despite not having that university education, Ki-woo is chosen by his university student friend Min, who is leaving to go to school, to take over his tutoring job to Park Da-hye, who Min plans to date once he returns to Seoul and she herself is in university. The Parks are a wealthy family that have lived in their modernistic house for four years, it designed by and is the former residence of famed architect Namsoong. While Mr. and Mrs. Park are all about status, Mrs. Park has a flighty, simpleminded mentality and temperament, which Min tells Ki-woo to feel comfortable in lying to her about his education to get the job. In getting the job, Ki-woo further learns that Mrs. Park is looking for an art therapist for the Parks' adolescent son, Da-song, Ki-woo quickly recommending his professional art therapist friend \"Jessica\", really Ki-jung who he knows can pull off the scam in being the easiest liar of the four Kims. In Ki-woo also falling for Da-hye, he begins to envision himself in that house, and thus the Kims as a collective start a plan for all the Kims, like Ki-jung using assumed names, to replace existing servants in the Parks' employ in orchestrating reasons for them to be fired. The most difficult to get rid of may be Moon-gwang, the Parks' housekeeper who literally came with the house - she Namsoong's housekeeper when he lived there - and thus knows all the little nooks and crannies of it better than the Parks themselves. The question then becomes how far the Kims can take this scam in their quest to become their version of the Parks.",
      "genre": {
        "id": 3,
        "name": "Comedy",
        "description": "Funny movies. Laugh till you start to cry"
      }
    },
    {
      "id": 3,
      "title": "John Wick",
      "genreId": 1,
      "releaseDate": "03-02-2019",
      "picture": "https://www.indiewire.com/wp-content/uploads/2019/05/07956f40-77c4-11e9-9073-657a85982e73.jpg",
      "summary": "John runs through New York as time runs out on his 'grace period'. He tuns into an alley and sees the Tick-Tock Man, one of the Bowery King's spies. He gets into a taxi, but the roads are gridlocked. With only twenty minutes until he is officially 'ex communicado', he decides to get out and run again, but not before he gives the driver a gold coin to get his dog safely to the continental. He arrives at the Library and asks for a book, in which he reveals a hidden compartment containing some coins, a cross, a marker and a picture of him and his wife, which he kisses. A large man, Ernest, corners him in the bookshelves. John tells him he still has time left, but Ernest doesn't care: who is going to know about a few minutes? The two have a fight which culminates in John using the book to break Ernest's jaw and snap his neck. It leaves him with a bad stab wound on his shoulder, though. So, he visits the doctor at his home address, with only five minutes to go. The doc agrees to help, but has to stop stitching halfway through. The 'grace period' is over.\n\nJohn's $14 million bounty is in full effect. After stitching himself up and taking some pills, John shoots the doc non fatally at his request, so the High Table believe that he obeyed the 'ex communicado'. Then, he leaves and is immediately set upon by a wave of assassins. They corner him in an antique arms shop, so John uses the old weaponry to take them out. After a vicious throwing-knife fight, he emerges into the street and is set upon by more assassins. They follow him into some stables, where John uses the horses and their powerful kicks to kill his foes. He leaves the stables on horseback but is followed by two bikers. Of course, he takes them out and proceeds with his journey.\n\nJohn's bounty is raised to $15 million. John arrives at a theatre, where he is told to empty his pockets and remove his belt. He meets with The Director and asks for her help by presenting the cross he picked up from the library. They discuss John's history: this is where he was raised. She takes him to the back of the theatre, past training ballet dancers and jiu jitsu wrestlers, and asks him what he wants. He wants passage to Casablanca. She agrees, breaking all ties with him and branding him with the cross in the process.\n\nA mysterious woman enters the Continental. She slides a coin over to Charon, who informs Winston, the manager, that an adjudicator is here to see him. After asking to see Santiago's body, The Adjudicator informs Winston that he must step down from his position due to the fact that he allowed John to live after spilling blood on Continental grounds. The Bowery King is visited by The Adjudicator. He tells her that he is honoring the 'ex communicado'. However, she informs him that no-one is free from the High Table's rules and that he must leave town because he gave John a gun knowing what it would be used for. He laughs in her face, claiming that he cannot step down from the throne because he is the throne.\n\nJohn arrives in Casablanca. Almost immediately, he is set upon by three knife-wielding foes. One is killed in the battle but the fight is cut short by a man who informs them both that the manager has granted John amnesty. The assassin isn't happy about this, so the man shoots him. He and John go to Morocco's Continental, where John is taken to see the manager. He sees photos of a woman and her daughter, before two growling dogs come and stand guard beside him. Then, the manager, Sofia, steps out of the shadows and shoots him in the chest. Luckily, his suit is bullet-proof. She tells him she ought to kill him, but he presents a marker. She asks him not to, but John requests that she take him to see her old boss. Reluctantly, she agrees and goes to get ready.\n\nThe Adjudicator goes to a small sushi shop. The chef is Zero, who recognizes her coin and tells her he didn't expect her so soon. He already knows about John and is interested in hunting him down. The Adjudicator tasks him with doing so, as well as going after all those who helped him.\n\nSofia returns to John heavily armed. John assures her he just wants to talk, but she's skeptical. They arrive at a complex and meet with Berrada, Sofia's old boss. John asks Berrada to take him to The Elder, the one who sits above the High Table, so he can make amends. Berrada doesn't know where he is, but knows that The Elder only finds those who he wants to find. He tells John to go to the desert and to follow the stars until he is almost dead, where The Elder may or may not find him. Before they can leave, Berrada demands a gift. He wants Sofia's dog but she won't give it to him. He shoots it instead. Thankfully, it is wearing a bullet-proof vest. John warns her against it, but Sofia shoots Berrada and a fight ensures, during which the dog mauls Berrada's groin. Once the guards are dead, Sofia shoots Berrada in the leg and the two make their escape, but more guards are on the way. They shoot their way out of the complex, fighting alongside their attack dogs, and then make their way to the desert.\n\nIn the theatre, The Director watches a ballet performance by her students. Meanwhile, her guards are being cut down by brutal but efficient ninjas. Three men walk on stage and interrupt the performance. The Adjudicator and Zero approach from behind. She tells The Director that her agreement with the High Table doesn't mean she should have helped John. Her penalty will be paid in blood. Zero stabs his sword through both her hands but leaves her alive.\n\nJohn and Sofia arrive at the foot of the desert. John pricks his finger and signs the marker with his blood. Sofia's debt is fulfilled. Sofia uses most the her water for her dogs and she swills the rest in her mouth before spitting it back in the bottle. She tells John that he is going to die, either here or later down the line. John sets off into the desert with the bottle as she leaves. He walks along sand dunes until it gets dark, then he keeps walking until he collapses.\n\nIn the Bowery King's complex, the ninjas brutally cut down many guards. Zero and The Adjudicator approach the Bowery King on the roof. He tells The Adjudicator that he is willing to show fealty but she says that he has had his chance. So, he remains defiant and sends his pigeon out of harm's way, before Zero deals him seven cuts as punishment for the seven bullets he gave John.\n\nIn the desert, a cloaked man comes across John. Then, John wakes up in a tent. He is face to face with The Elder, who informs him that he has never seen a man so lost. He asks him why he wants to live. John says it is to remember Helen. So, The Elder gives him a choice: die here or come the boogeyman again, remembering through death. He can never be 'out', like he once was, but he can reverse the 'ex communicado'. All he must do is kill Winston. John agrees and pledges elegance by cutting off his wedding-ring, along with his ring-finger. The Elder gives him a suit and passage back to New York.\n\nUpon arriving in New York, John comes face-to-face with two assassins. However, they are cut down by some ninjas. The ninjas take john to see Zero. John and Zero are about to fight, but a line of school-children interrupt them. John makes his escape, killing two motorcycle ninjas and taking a bike. Zero and his make give chase. On the freeway, John takes out several sword-wielding opponents while driving at high-speed. Zero chases him into the city, but they both crash near the Continental. Since John has his hand on Continental grounds, Zero cannot kill him. Charon takes John to a waiting room and Zero follows. Here, he confess how much of a fan he is. He tells John that they're the same, but John doesn't agree. John reunites with his dog but tells him to sit and stay once Winston is ready to see him.\n\nWinston meets with John in a glass room used only when one needs to see what their opponent hides under the table. He knows John is here to kill him and prefers to be killed by a friend, but tells John that their is another way. He can pull the trigger and sell his soul, forever becoming the boogeyman and working for the High Table, or he can stand and fight against the High Table, eventually dying as the man his wife loved. The Adjudicator arrives to see if Winston will step down. He will not. She asks if John will kill him. He will not. So, she declares the Continental deconsecrated. Business can now be conducted on its grounds, and both men are targets. Some of the High Table's finest will be joining them shortly. However, under the circumstances, Winston sees it fit to reinstate all of John's privileges. He'll need guns. Lots of guns.\n\nJohn is shown to the arms room where he is told that the High Table have improved their armor and is recommended a stronger calibre round. Winston locks himself in the arms safe while John, Charon and some loyal men go to fight the onslaught of High Table goons. Their armor is tougher than anyone thought, so John has to get up close and personal. The Adjudicator phones Winston, asking how long he thinks he can keep the defense up. He puts the phone down before she finishes speaking. Only John and Charon survive the High Table's first wave. They regroup in the arms safe, where Charon introduces him to an armor-piercing shotgun. The second wave arrives and John makes quick work of them, the shotgun able to blow their heads clean off. The Adjudicator phones Winston again and asks if a parlay might be beneficial. He agrees.\n\nJohn makes his way to the glass room from before, where he is attacked by two ninjas and thrown through several glass displays. Eventually, he manages to kill both using their own sword. He makes his way upstairs, as Zero taunts him through the glass, but is attacked by two of Zero's best men. The Shinobi get the upper-hand and have the opportunity to kill John, but refrain from doing so to talk about the honor of fighting him. The fight resumes and they knock John down again. As he struggles to get back up, they discuss him being out of shape because of his recent retirement. John takes off his belt and prepares it as a weapon. After a protracted third round, where a tired John resorts to groin-kicks and ear-slaps, John is able to perform a slam on an opponent that shatters the glass ground and sends them all crashing to the lower floor. The Shinobi can't get up but John can. He leaves to go and find Zero, who is on the upper floor. Zero and John have a long sword fight. Eventually, John gets the upper-hand by using Zero's own 'disappearing trick' against him. Even through he's badly bleeding, Zero keeps fighting until John shoves a sword straight through his chest. Worn out, both men sit together. Zero talks about how good the fight was and tells John he will catch up to him. He won't. As John leaves, Zero slumps to the side, dead.\n\nWinston and The Adjudicator are on the roof, having a parlay. She tells Winston that this was just the first wave, that more will come and that the Continental will fall. Winston retorts by claiming he could take the Continental back; his ties go deeper than these walls, he is New York. John arrives as The Adjudicator decides Winston's show of power was a show of fealty. She reinstates the Continental and him as manager, but tells him that something must be done about John. Winston agrees and shoots John several times. The bullets bounce off his Jacket but push him back until he falls from the roof, bouncing on various things which somewhat break his fall. Still, he hits the ground hard. The Adjudicator is satisfied.\n\nAs The Adjudicator leaves, she decide's she needs to check John's body. She re-enters the Continental and tells Winston the body is gone. She tells him that they do not want John Wick coming after them. Winston agrees and whispers \"Baba Yaga\".\n\nThe Tick-Tock Man wheels a cart, as John's dog follows. He tips a battered and broken John out of the cart, who rolls to a stop in front of a makeshift throne. On the throne, drinking a soda, is the Bowery King. He is cut-up quite badly, and tells John to raise a hand if he can hear him. John's three-fingered hand goes up. The Bowery King talks about John's betrayal and the High Table's rules. He mentions that more things get done under the table that he's really \"pissed off\". He asks John if he's \"pissed off\", too. John slowly raises his head. He's bloody and has a messed-up eye but he can still answer. \"Yeah.\"",
      "genre": {
        "id": 1,
        "name": "Action",
        "description": "Action movies. thrilling from start to end"
      }
    },
    {
      "id": 4,
      "title": "Last Black Man In San Francisco",
      "genreId": 3,
      "releaseDate": "28-05-2019",
      "picture": "https://ww2.kqed.org/wp-content/uploads/sites/2/2019/05/LastBlackManinSF.jpg",
      "summary": "immie Fails is a young man living in Bayview-Hunters Point, San Francisco. He spends his time wandering around town with his best friend Montgomery \"Mont\" Allen, who he also lives with, along with Mont's grandfather. Jimmie waits for the bus with Mont every day, during which they see various states of change in the city and protesters trying to stop it. The two then ride to a classic Victorian house in the city's Fillmore District that Jimmie grew up in and says was built by his grandfather in 1946. The home is currently occupied by an older couple, and Jimmie often laments to Mont about how the couple doesn't take care of the house while doing his best to remodel it himself. One day, Jimmie and Mont visit the house only to find the woman crying on her husband's shoulder and movers taking the couple's things.\n\nJimmie and Mont go to a local realtor, who informs them that the woman's mother had died and now she and her sister are fighting over the house. They use this opportunity to visit the now vacant house and be free to finally re-explore the house in its entirety. Deciding to take up residence, the pair visit Jimmie's aunt Wanda, who gives them the interior decorations that they had when living there. Jimmie and Mont ride back to the home with the help of Wanda's husband, Ricky, and unpack the items, displaying them throughout the house.\n\nOne night, Mont invites Kofi, a childhood friend of Jimmie's and his, to the house, and the three enjoy a night of relaxation. However, the next day, Kofi says hurtful things to Jimmie about his father to appear dominant after being called \"feminine\" by his friends. Jimmie and Mont later find out from Kofi's friends that he has been killed by a man he had a scuffle with. At the same time, the pair find that their possessions have been thrown out of the house and left on the sidewalk, in addition to a sign posted by the realtor they went to earlier. Feeling betrayed, Jimmie fights back by putting all of it right back in. Mont, however, goes to the realtor, who reveals that the house wasn't built by Jimmie's grandfather, and has the deed to prove that it was actually built in the 1850s.\n\nMont writes a play about the aftermath of Kofi's death and encourages Jimmie to advertise it to passerby, holding it in the \"witch hat\" of the house. On the day of the performance, Jimmie's estranged father, who he had previously gotten into an argument with, shows. During the performance, Mont shows various social media posts about Kofi's death, all of which he proclaims show that these people never really knew Kofi. He asks various people in the crowd to recount their opinions on Kofi, including Jimmie, who says that even though the last thing that Kofi ever said to him was mean, his experience with him in a group home was friendly, saying that \"people aren't one thing\". Mont reveals to Jimmie that his grandfather didn't build the home, leaving him shocked.\n\nJimmie reunites with Mont at the dock before going home. He watches TV with Mont and Grandpa Allen before going to bed. Mont wakes up and finds Jimmie gone, with a note that thanks Mont for being his best friend. Mont is left alone, shown in various daily activities that the two used to share happily now lifeless. He watches from the dock, where Jimmie is far away, rowing in the water outside the Golden Gate Bridge.",
      "genre": {
        "id": 3,
        "name": "Comedy",
        "description": "Funny movies. Laugh till you start to cry"
      }
    },
    {
      "id": 5,
      "title": "Avengers: End Game",
      "genreId": 1,
      "releaseDate": "28-05-2019",
      "picture": "https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2019%2F04%2Fscreencapture-file-C-Users-JckNa-OneDrive-Desktop-b-avengersendgame-horizontal-friday-17793-04d92fbf-webp-2019-04-23-08_14_14.jpg",
      "summary": "In the opening, Clint Barton is teaching his daughter archery on his secluded farm while his wife prepares a picnic lunch for them. Suddenly, Clint's daughter vanishes and the rest of Clint's family disintegrates, along with half of all life across the universe, the result of Thanos' snapping his fingers after acquiring all six Infinity Stones. Nebula and Tony Stark are stranded in space following their defeat by Thanos on Titan, but are returned to Earth by Carol Danvers and reunited with Natasha Romanoff, Bruce Banner, Steve Rogers, Rocket, Thor, and James Rhodes. The team formulates a plan to steal the Infinity Stones back from Thanos and use them to reverse his actions, but learn upon finding him that he had used the stones a second time to destroy them, preventing their further use. He tells the remaining Avengers that he did so to avoid using the Stones for further nefarious purposes. Enraged, Thor cuts off Thanos' head, saying it's what he should have done in Wakanda.\n\nFive years later, Scott Lang escapes from the quantum realm to discover that his daughter Cassie is now a teenager and that Hope van Dyne, along with half of the population, has disappeared in the snap. Rogers has been leading grief counseling sessions for survivors still struggling with the effects of the snap, while Romanoff is tirelessly keeping watch over both Earth and the rest of the universe with the help of Rhodes, Danvers, Okoye, Rocket, and Nebula. Lang goes to Romanoff and Rogers, and explains that while five years had passed for them, only five hours had passed for him in the quantum realm and the difference in time factors there. The three go to Stark, who is now raising a child with Pepper Potts, and explain their theory that the quantum realm can be used to go back in time and steal the Infinity Stones before Thanos is able to collect them. Stark initially rejects their proposal with concern about risking his family and the peace he has found, but after reflecting upon the loss of Peter Parker decides to test theoretical models that would work with Lang's quantum tunnel, eventually finding one that works.\n\nWith Stark now on board with the plan, the remaining Avengers set out to reassemble their team. Bruce Banner has now embraced the Hulk as a part of him, and has melded his own consciousness and the Hulk's together into one. Romanoff, after hearing reports from Rhodes of an assassin that operates with similar methods to Barton, goes the Japan to track him down. Barton, consumed with grief after the loss of his family, has been operating under the mantle \"Ronin\" while brutally massacring cartels and gangs in order to try and improve the world that's still left. Natasha finds him in Japan and after some convincing, he agrees to rejoin the team in order to try and bring his family back. Banner and Rocket go to the small town of New Asgard, where Valkyrie and the last survivors of Asgard have settled. They there find Thor, who has become overwhelmed by guilt over failing to kill Thanos in Wakanda. Thor has become overweight, his hair and beard are overgrown, and he spends his free time eating junk food, getting drunk, and playing Fortnite with his friends Korg and Miek. Thor begrudgingly agrees to return to the Avengers after some convincing from Rocket and Banner.\n\nAfter testing the quantum time machine on Barton, who confirms that it works, The Avengers are reunited with a plan - Banner, Rogers, Lang, and Stark embark to retrieve the Time, Mind, and Space stones during the battle of New York in 2012. Banner goes to the Sanctum Sanctorum, where he is informed by the Ancient One that taking the Time Stone from her time line would prevent Stephen Strange's future efforts to stop Kaecilius from destroying the laws of nature. She eventually concedes the Time Stone to Banner after he informs her that Strange had given Thanos the stone in his time line, implying Strange had intended for a specific sequence of events to occur for Thanos to be defeated. Banner also promises the stones' return to their proper time lines in order to prevent any ill effects. Lang and Stark attempt to steal the Space Stone after the Avengers confiscate it from Loki. Lang gives Stark's past self a cardiac arrest by pulling a circuit in his artificial heart, while Stark steals the briefcase housing the Tesseract when nobody is looking. Their plan is thwarted when Stark drops the briefcase after he is accidentally hit by the Hulk. Loki then steals the Space Stone and uses it to escape custody. Rogers succeeds in stealing the Mind Stone from undercover Hydra agents, but stumbles across his past self, who mistakes him for a disguised Loki. After defeating past-Steve, Rogers meets back up with Stark and Lang, who now must figure out another way to get the Space Stone without running out of the limited supply of Pym Particles that allow them to travel through the quantum realm. Lang returns to the present with the Mind Stone while Rogers and Stark devise a plan to steal the Space Stone from a U.S. Army installation in the 1970s, while stealing further vials of Pym Particles in order to make the journey back home. While there, Rogers sights Peggy Carter and Stark has an meaningful conversation with his father Howard.\n\nRocket and Thor travel to Asgard to retrieve the Reality Stone before Malekith uses it against the Nine Realms. While in Asgard, Thor is reminded that his mother, Frigga, would die soon and has a chance encounter with her while Rocket steals the Aether, the vaporized version of the Reality Stone, from Jane Foster. The two return to Earth after Frigga counsels Thor and he retrieves his hammer Mjolnor, elated to discover that he is still worthy of it. Nebula and Rhodes travel to Morag to steal the Power Stone before Peter Quill does. As Rhodes returns to the present with the Power Stone, Nebula malfunctions and remains on Morag. With two consciousnesses operating on Nebula's systems, Thanos and Ebony Maw discover the presence of future Nebula and go to kidnap her. Nebula realizes what has happened and tries to warn the others, but is too late. Thanos scans her memories and discovers the Avengers' plan, and sends the more loyal past Nebula back to the present as a spy. Barton and Romanoff travel to Vormir to retrieve the Soul Stone, though are conflicted when Red Skull, keeper of the Soul Stone, informs them that the stone can only be retrieved by sacrificing someone they love. The two fight over which will make the sacrifice, with Romanoff ultimately taking the fall, while a distraught Barton returns to Earth with the Soul Stone.\n\nAfter everyone has returned to the present on Earth, Stark, Rocket, and Banner set out to craft a gauntlet to wield the stones, one constructed from the same nanotech of Stark's latest Iron Man suit. Banner volunteers himself to wield the gauntlet and bring back everyone that disappeared in Thanos's snap, reasoning that he can withstand both the gamma radiation and the immense pain brought on by using the stones. He succeeds, though they are almost immediately attacked by Thanos, who has been brought to Earth by the impostor Nebula, destroying the quantum portal in the process. Thanos reduces the Avengers headquarters to rubble, splitting the team up and causing the gauntlet to fall into Barton's protection. The past Nebula is killed by her future self as she attempts to take the Infinity Stones from Barton, while Rogers, Thor, and Stark confront Thanos, who decides he will instead use the Infinity Stones to destroy the universe and create one in his vision. The three fight Thanos one on one, with Rogers confirming Thor's theory that he is worthy of wielding Mjolnor, but are each bested by Thanos. Soon after Thanos' army lands on Earth, T'Challa appears before Rogers, along with all of the Avengers and other allies revived by Banner, before launching an assault on Thanos and his army. After a lengthy battle during which Stark is reunited with Parker and Quill is reunited with past Gamora, Thanos wrestles with numerous Avengers for the Infinity Stones. When he's bound by Wanda Maximoff's energy, Thanos orders Glaive to have his ship fire multiple energy blasts, nearly devastating the Avengers' efforts. Captain Marvel reappears, taking out Thanos' ship while fighting for control of the gauntlet. Using the nanotech from the new gauntlet, Stark maneuvers the Infinity Stones from Thanos' hand to his own and uses them to turn Thanos and his entire army into dust, triumphantly stating \"I am Iron Man.\" Parker and Potts console Stark as he dies from exposure to the Stones' radiation.\n\nFollowing the battle, The Avengers hold a funeral for Stark, whose Mark I arc reactor is floated out on the lake next to his house. Barton and Wanda Maximoff take solace in the fact that Romanoff and Vision, who did not return in the snap, would be proud of their victory over Thanos. Thor makes Valkyrie the Queen of Asgard and joins the Guardians of the Galaxy in order to find his true purpose, free of the burden of royalty and leadership for the first time in his life. Barton returns home to his family and Parker returns to school, where he is reunited with his best friend Ned. Meanwhile, Rogers is tasked to go into the past to return the stones and Thor's hammer to their original time lines, but decides not to return to the present and to instead live the rest of his life in the past with Carter. He reappears before Sam Wilson and Bucky Barnes as an old man, and passes his shield and the mantle of Captain America on to Wilson. A brief flashback shows Rogers and Carter finally sharing the dance they never got to have in their living room, truly happy at last.",
      "genre": {
        "id": 3,
        "name": "Comedy",
        "description": "Funny movies. Laugh till you start to cry"
      }
    },
    {
      "id": 6,
      "title": "Mary Poppins Returns",
      "genreId": 3,
      "releaseDate": "28-11-2018",
      "picture": "https://halleonard-closerlook.s3.amazonaws.com/00285401/00285401_Coverz.jpg",
      "summary": "Decades after her original visit, the magical nanny returns to help the Banks siblings and Michael's children through a difficult time in their lives."
    },
    {
      "id": 7,
      "title": "Dumbo",
      "genreId": 5,
      "releaseDate": "03-05-2019",
      "picture": "https://media.swncdn.com/cms/CW/Movies/66171-dumbo-1.1200w.tn.jpg",
      "summary": "A young elephant, whose oversized ears enable him to fly, helps save a struggling circus, but when the circus plans a new venture, Dumbo and his friends discover dark secrets beneath its shiny veneer."
    },
    {
      "id": 8,
      "title": "Spider-Man: Far from Home",
      "genreId": 2,
      "releaseDate": "03-05-2019",
      "picture": "https://static0.srcdn.com/wordpress/wp-content/uploads/2019/08/Spider-Man-Far-From-Home-Extended-Cut-Scenes-SR.jpg?q=50&fit=crop&w=960&h=500&dpr=1.5",
      "summary": "Following the events of Avengers: Endgame (2019), Spider-Man must step up to take on new threats in a world that has changed forever."
    },
    {
      "title": "Joker",
      "releaseDate": "08-08-2019",
      "summary": "In 1981, party clown, social outsider and aspiring stand-up comedian Arthur Fleck lives with his mother, Penny, in Gotham City. Gotham's class society is rife with crime and unemployment, leaving segments of the population disenfranchised and impoverished. Arthur suffers from a medical disorder that causes him to laugh at inappropriate times, and depends on social services for medication. After a gang of delinquents attacks Arthur in an alley, his co-worker, Randall, gives him a gun for protection. Arthur invites his neighbor, single mother Sophie, to his stand-up comedy show, and they begin dating.\n\nWhile entertaining at a children's hospital, Arthur's gun falls out of his pocket. Randall lies that Arthur bought the gun himself and Arthur is fired. On the subway, still in his clown makeup, Arthur is beaten by three drunken Wayne Enterprises businessmen who were harassing a female passenger; he shoots two in self-defense and executes the third. The murders are condemned by billionaire mayoral candidate Thomas Wayne, who labels those envious of more successful people as \"clowns\". Demonstrations against Gotham's rich begin, with protesters donning clown masks in Arthur's image. Funding cuts shutter the social service program, leaving Arthur without medication.\n\nArthur's comedy show goes poorly; he laughs uncontrollably, tries to say that he hated school as a child and has difficulty delivering his jokes. His idol, talk show host Murray Franklin, later mocks Arthur by showing clips from the routine on his show. Arthur intercepts a letter written by Penny to Thomas, alleging that he is Thomas's illegitimate son, and berates his mother for hiding the truth. At Wayne Manor, Arthur talks to Thomas's young son, Bruce, but flees after a scuffle with butler Alfred Pennyworth. Following a visit from two Gotham City Police Department detectives investigating Arthur's involvement in the train murders, Penny suffers a stroke and is hospitalized.\n\nAt a public event, Arthur confronts Thomas, who tells him that Penny is delusional and not his biological mother, and as Arthur begins to laugh he gets punched by Thomas. In denial, Arthur visits Arkham State Hospital and steals Penny's case file; the file says Penny adopted Arthur as a baby and allowed her abusive boyfriend to harm them both. Penny alleged that Thomas used his influence to fabricate the adoption and commit her to the asylum to hide their affair. Distraught, Arthur goes to the hospital and kills Penny. He returns home and enters Sophie's apartment unannounced. Frightened, Sophie tells him to leave; their previous encounters were Arthur's delusions.\n\nArthur is invited to appear on Murray's show due to the unexpected popularity of his comedy routine's clips. As he prepares, Arthur is visited by Randall and fellow ex-colleague Gary. Arthur murders Randall as revenge, but leaves Gary unharmed for treating him well in the past. En route to the studio, Arthur is pursued by the two detectives onto a train filled with clown protesters. One detective accidentally shoots a protester and incites a riot, allowing Arthur to escape.\n\nBefore the show goes live, Arthur requests that Murray introduce him as Joker, a reference to Murray's previous mockery. Arthur walks out to applause, but tells morbid jokes, admits he killed the men on the train, and rants about bullies and how society abandons the disenfranchised. Arthur then fatally shoots Murray and is arrested as riots break out across all of Gotham. One rioter corners the Wayne family in an alley and murders Thomas and his wife Martha, sparing Bruce.[a] Arthur watches the city go up in chaos from the window of the police car and laughs. Rioters in an ambulance crash into the police car and free Arthur. He smears blood on his face in the form of a smile and dances to the cheers of the crowd.\n\nAt Arkham, Arthur laughs to himself about a joke and tells his psychiatrist she would not understand it. He runs from orderlies, leaving a trail of bloodied footprints.",
      "picture": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/joker-trailer-new.jpg",
      "genreId": 6,
      "id": 9
    }
  ]
}